; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	thermograph0 - mode
	spectrograph4 - mode
	image1 - mode
	image3 - mode
	spectrograph2 - mode
	star2 - direction
	groundstation3 - direction
	groundstation1 - direction
	groundstation4 - direction
	groundstation0 - direction
	phenomenon5 - direction
	planet6 - direction
	phenomenon7 - direction
	planet8 - direction
	phenomenon9 - direction
	star10 - direction
	planet11 - direction
	star12 - direction
	star13 - direction
	star14 - direction
	planet15 - direction
	planet16 - direction
	star17 - direction
	planet18 - direction
	phenomenon19 - direction
	star20 - direction
	planet21 - direction
	phenomenon22 - direction
	star23 - direction
	star24 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 groundstation0)
	(supports instrument1 image3)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 star2)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 groundstation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 groundstation3)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 groundstation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 phenomenon19)
	(supports instrument4 image3)
	(supports instrument4 spectrograph4)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 groundstation4)
	(supports instrument5 spectrograph2)
	(supports instrument5 image3)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 groundstation1)
	(supports instrument6 spectrograph2)
	(supports instrument6 spectrograph4)
	(calibration_target instrument6 groundstation4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 star12)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 groundstation3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 groundstation1)
	(supports instrument8 image1)
	(supports instrument8 spectrograph2)
	(supports instrument8 spectrograph4)
	(calibration_target instrument8 groundstation3)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 planet8)
	(supports instrument9 image3)
	(supports instrument9 image1)
	(calibration_target instrument9 groundstation1)
	(supports instrument10 image3)
	(calibration_target instrument10 groundstation4)
	(supports instrument11 spectrograph2)
	(calibration_target instrument11 groundstation0)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 phenomenon7)
)
(:goal (and
	(pointing satellite0 phenomenon5)
	(have_image phenomenon5 image3)
	(have_image planet6 image3)
	(have_image phenomenon7 spectrograph4)
	(have_image planet8 spectrograph4)
	(have_image phenomenon9 spectrograph4)
	(have_image star10 image1)
	(have_image star12 spectrograph4)
	(have_image star13 thermograph0)
	(have_image star14 spectrograph2)
	(have_image planet15 image1)
	(have_image planet16 image1)
	(have_image star17 thermograph0)
	(have_image planet18 spectrograph4)
	(have_image phenomenon19 image3)
	(have_image star20 thermograph0)
	(have_image planet21 image3)
	(have_image phenomenon22 spectrograph4)
	(have_image star23 spectrograph4)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 19
2. (turn_to satellite4 groundstation3 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 groundstation3)
   goals met: 0 of 19
3. (calibrate satellite4 instrument8 groundstation3)
   added: (calibrated instrument8)
   goals met: 0 of 19
4. (turn_to satellite4 phenomenon22 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 phenomenon22)
   goals met: 0 of 19
5. (take_image satellite4 phenomenon22 instrument8 spectrograph4)
   added: (have_image phenomenon22 spectrograph4)
   goals met: 1 of 19
6. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 19
7. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 19
8. (turn_to satellite4 phenomenon7 phenomenon22)
   deleted: (pointing satellite4 phenomenon22)
   added: (pointing satellite4 phenomenon7)
   goals met: 1 of 19
9. (take_image satellite4 phenomenon7 instrument8 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 2 of 19
10. (turn_to satellite4 phenomenon9 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 phenomenon9)
   goals met: 2 of 19
11. (take_image satellite4 phenomenon9 instrument8 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 3 of 19
12. (turn_to satellite4 planet15 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet15)
   goals met: 3 of 19
13. (take_image satellite4 planet15 instrument8 image1)
   added: (have_image planet15 image1)
   goals met: 4 of 19
14. (turn_to satellite4 planet16 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet16)
   goals met: 4 of 19
15. (take_image satellite4 planet16 instrument8 image1)
   added: (have_image planet16 image1)
   goals met: 5 of 19
16. (turn_to satellite4 planet18 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 planet18)
   goals met: 5 of 19
17. (take_image satellite4 planet18 instrument8 spectrograph4)
   added: (have_image planet18 spectrograph4)
   goals met: 6 of 19
18. (turn_to satellite4 planet8 planet18)
   deleted: (pointing satellite4 planet18)
   added: (pointing satellite4 planet8)
   goals met: 6 of 19
19. (take_image satellite4 planet8 instrument8 spectrograph4)
   added: (have_image planet8 spectrograph4)
   goals met: 7 of 19
20. (turn_to satellite4 star10 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star10)
   goals met: 7 of 19
21. (take_image satellite4 star10 instrument8 image1)
   added: (have_image star10 image1)
   goals met: 8 of 19
22. (turn_to satellite4 star12 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star12)
   goals met: 8 of 19
23. (take_image satellite4 star12 instrument8 spectrograph4)
   added: (have_image star12 spectrograph4)
   goals met: 9 of 19
24. (turn_to satellite4 star14 star12)
   deleted: (pointing satellite4 star12)
   added: (pointing satellite4 star14)
   goals met: 9 of 19
25. (take_image satellite4 star14 instrument8 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 10 of 19
26. (turn_to satellite4 star23 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 star23)
   goals met: 10 of 19
27. (take_image satellite4 star23 instrument8 spectrograph4)
   added: (have_image star23 spectrograph4)
   goals met: 11 of 19
28. (turn_to satellite1 groundstation1 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 groundstation1)
   goals met: 11 of 19
29. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 11 of 19
30. (turn_to satellite1 star13 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star13)
   goals met: 11 of 19
31. (take_image satellite1 star13 instrument3 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 12 of 19
32. (turn_to satellite1 star17 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star17)
   goals met: 12 of 19
33. (take_image satellite1 star17 instrument3 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 13 of 19
34. (turn_to satellite1 star20 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star20)
   goals met: 13 of 19
35. (take_image satellite1 star20 instrument3 thermograph0)
   added: (have_image star20 thermograph0)
   goals met: 14 of 19
36. (turn_to satellite0 phenomenon19 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon19)
   goals met: 14 of 19
37. (turn_to satellite0 star2 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 star2)
   goals met: 14 of 19
38. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 14 of 19
39. (turn_to satellite0 phenomenon19 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon19)
   goals met: 14 of 19
40. (take_image satellite0 phenomenon19 instrument1 image3)
   added: (have_image phenomenon19 image3)
   goals met: 15 of 19
41. (turn_to satellite0 phenomenon5 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 phenomenon5)
   goals met: 16 of 19
42. (take_image satellite0 phenomenon5 instrument1 image3)
   added: (have_image phenomenon5 image3)
   goals met: 17 of 19
43. (turn_to satellite0 planet21 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet21)
   goals met: 16 of 19
44. (take_image satellite0 planet21 instrument1 image3)
   added: (have_image planet21 image3)
   goals met: 17 of 19
45. (turn_to satellite0 phenomenon5 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 phenomenon5)
   goals met: 18 of 19
46. (turn_to satellite0 planet6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet6)
   goals met: 17 of 19
47. (take_image satellite0 planet6 instrument1 image3)
   added: (have_image planet6 image3)
   goals met: 18 of 19
48. (turn_to satellite0 phenomenon5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon5)
   goals met: 19 of 19
